In [65]:
import pandas as pd

In [70]:
df=pd.read_csv("services.csv")

In [71]:
# df=pd.read_csv("services.csv",header=None)

In [72]:
# df=pd.read_csv("services.csv",skiprows=2)

In [73]:
df.columns

Index(['id', 'location_id', 'program_id', 'accepted_payments',
       'alternate_name', 'application_process', 'audience', 'description',
       'eligibility', 'email', 'fees', 'funding_sources',
       'interpretation_services', 'keywords', 'languages', 'name',
       'required_documents', 'service_areas', 'status', 'wait_time', 'website',
       'taxonomy_ids'],
      dtype='object')

In [74]:
df=pd.read_csv("services.csv",usecols=['eligibility', 'email', 'fees'])

In [75]:
df

,eligibility,email,fees
0,"Age 55 or over for most programs, age 60 or ov...",NaN,$2.50 suggested donation for lunch for age 60 ...
1,"Age 55 or over, county resident and willing an...",NaN,None. Donations requested of clients who can a...
2,Resident of San Mateo County age 55 or over,NaN,None.
3,None,NaN,"Vary according to income ($5-$90). Cash, check..."
4,Eligibility: Low-income family with legal cust...,NaN,$60 application fee. Cash or checks accepted.
5,None,NaN,$55 per year membership dues. Classes have fee...
6,Age 18 or over,NaN,$85 per day. Vary according to income for thos...
7,Homebound person unable to cook or shop,NaN,Suggested donation of $4.25 per meal for senio...
8,Resident of California to obtain a library card,NaN,None.
9,Resident of California to obtain a card,NaN,None.
10,Resident of California to obtain a library car...,NaN,None.
11,English-speaking adult reading at or below 7th...,NaN,None.
12,Resident of California to obtain a library card,NaN,None.
13,None for most services. For emergency assistan...,NaN,None.
14,"Age 21-60, detoxed, physically able and willin...",NaN,None.
15,None for emergency assistance,NaN,None for emergency services. Vary for after sc...
16,Low-income families,NaN,None.
17,Low-income person without access to health care,NaN,None.
18,Low-income person without access to health care,NaN,None.
19,NaN,NaN,NaN
20,NaN,NaN,NaN
21,None,passports@example.org,"None, except for permits and photocopying. Cas..."
22,None,NaN,"None, except for permits and photocopying. Cas..."

In [76]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23 entries, 0 to 22
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   eligibility  21 non-null     object
 1   email        1 non-null      object
 2   fees         21 non-null     object
dtypes: object(3)
memory usage: 680.0+ bytes

In [78]:
df.dtypes

eligibility    object
email          object
fees           object
dtype: object

In [79]:
df.describe()

       eligibility                  email   fees
count           21                      1     21
unique          16                      1     10
top           None  passports@example.org  None.
freq             4                      1     11

In [80]:
df.shape

(23, 3)

In [81]:
col1=['hi','hello','king']
col2=[1,2,3]
col3=[2,3,4]

In [82]:
data={"col1":col1,"col2":col2,"col3":col3}

In [83]:
data1=pd.DataFrame(data)

In [84]:
data1

    col1  col2  col3
0     hi     1     2
1  hello     2     3
2   king     3     4

In [86]:
data1.at[1,'col3']=30

In [87]:
data1

    col1  col2  col3
0     hi     1     2
1  hello     2    30
2   king     3     4

In [88]:
data1.loc[data1['col1']=="king",'col1']=100

In [89]:
data1

    col1  col2  col3
0     hi     1     2
1  hello     2    30
2    100     3     4

In [90]:
data1["col4"]=100

In [91]:
data1

    col1  col2  col3  col4
0     hi     1     2   100
1  hello     2    30   100
2    100     3     4   100

In [92]:
data1.set_index("col3")

       col1  col2  col4
col3
2        hi     1   100
30    hello     2   100
4       100     3   100

In [94]:
data1.reset_index(drop=True,inplace=True)

In [95]:
data1

    col1  col2  col3  col4
0     hi     1     2   100
1  hello     2    30   100
2    100     3     4   100

In [96]:
data2=data1[["col1","col2"]]

In [97]:
data2

    col1  col2
0     hi     1
1  hello     2
2    100     3

In [100]:
new_row={"col1":"name1","col2":24,"col3":32,"col4":67}

In [102]:
data1=data1.append(new_row,ignore_index=True)

C:\Users\kondaparthy vishal\AppData\Local\Temp\ipykernel_17636\2764649530.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  data1=data1.append(new_row,ignore_index=True)

In [103]:
data1

    col1  col2  col3  col4
0     hi     1     2   100
1  hello     2    30   100
2    100     3     4   100
3  name1    24    32    67

In [104]:
df1=pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [105]:
import lxml

url_df = pd.read_html("https://www.basketball-reference.com/leagues/NBA_2015_totals.html")

In [107]:
df1.to_csv("players.csv", index=False)